# Taps
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'colima'
brew 'coreutils' # Those that come with macOS are outdated
# brew 'derailed/k9s/k9s'
# brew docker
# brew docker-compose
# brew 'ffmpeg'
# brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'grep'
brew 'jq'
# brew 'kubectl'
# brew 'kubectx'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mike-engel/jwt-cli/jwt-cli'
# brew 'mkdocs'
brew 'wget'
brew 'yarn'
brew 'yq'

# Apps
cask 'chatgpt'
cask 'dotnet-sdk'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
# cask 'slack'
cask 'postman'
cask 'proxyman'
cask 'spotify'
cask 'visual-studio-code'
cask 'warp'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-meslo-for-powerline'

# Mac App Store
mas 'CopyClip - Clipboard History', id: 595191960
