# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'colima'
brew 'coreutils' # Those that come with macOS are outdated
# brew 'derailed/k9s/k9s'
# brew dotnet
# brew docker
# brew docker-compose
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'iterm2'
# brew 'kubectl'
# brew 'kubectx'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mike-engel/jwt-cli/jwt-cli'
# brew 'mkdocs'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'yarn'
brew 'yq'


# Apps
cask 'firefox'
cask 'google-chrome'
# cask 'slack'
cask 'postman'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'CopyClip - Clipboard History', id: 595191960